Ran Plan for project: `terraform-infra` dir: `TERRAFORM` workspace: `default`

<details><summary>Show Output</summary>

```diff
data.aws_availability_zones.available_zones: Reading...
data.aws_caller_identity.current: Reading...
data.aws_region.current: Reading...
data.aws_region.current: Read complete after 0s [id=us-east-1]
data.aws_availability_zones.available_zones: Read complete after 2s [id=us-east-1]
data.aws_caller_identity.current: Read complete after 2s [id=053236955074]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_alb.application_load_balancer will be created
+ resource "aws_alb" "application_load_balancer" {
      + arn                                         = (known after apply)
      + arn_suffix                                  = (known after apply)
      + desync_mitigation_mode                      = "defensive"
      + dns_name                                    = (known after apply)
      + drop_invalid_header_fields                  = false
      + enable_deletion_protection                  = false
      + enable_http2                                = true
      + enable_tls_version_and_cipher_suite_headers = false
      + enable_waf_fail_open                        = false
      + enable_xff_client_port                      = false
      + id                                          = (known after apply)
      + idle_timeout                                = 60
      + internal                                    = (known after apply)
      + ip_address_type                             = (known after apply)
      + load_balancer_type                          = "application"
      + name                                        = "alb-app"
      + preserve_host_header                        = false
      + security_groups                             = (known after apply)
      + subnets                                     = (known after apply)
      + tags                                        = {
          + "Name" = "alb-app"
        }
      + tags_all                                    = {
          + "App"         = "API Livros"
          + "Environment" = "Production"
          + "Managed-by"  = "Terraform"
          + "Name"        = "alb-app"
          + "Owner"       = "Anderson Quideroli"
          + "Project"     = "AWS-challenge"
          + "Version"     = "1.0"
        }
      + vpc_id                                      = (known after apply)
      + xff_header_processing_mode                  = "append"
      + zone_id                                     = (known after apply)

      + subnet_mapping (known after apply)
    }

  # aws_appautoscaling_policy.api_target_cpu will be created
+ resource "aws_appautoscaling_policy" "api_target_cpu" {
      + alarm_arns         = (known after apply)
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "api_target_cpu"
      + policy_type        = "TargetTrackingScaling"
      + resource_id        = "service/api-cluster/api-service"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + target_tracking_scaling_policy_configuration {
          + disable_scale_in   = false
          + scale_in_cooldown  = 300
          + scale_out_cooldown = 300
          + target_value       = 80

          + predefined_metric_specification {
              + predefined_metric_type = "ECSServiceAverageCPUUtilization"
            }
        }
    }

  # aws_appautoscaling_policy.api_target_memory will be created
+ resource "aws_appautoscaling_policy" "api_target_memory" {
      + alarm_arns         = (known after apply)
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "api_target_memory"
      + policy_type        = "TargetTrackingScaling"
      + resource_id        = "service/api-cluster/api-service"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + target_tracking_scaling_policy_configuration {
          + disable_scale_in   = false
          + scale_in_cooldown  = 300
          + scale_out_cooldown = 300
          + target_value       = 80

          + predefined_metric_specification {
              + predefined_metric_type = "ECSServiceAverageMemoryUtilization"
            }
        }
    }

  # aws_appautoscaling_target.api_to_target will be created
+ resource "aws_appautoscaling_target" "api_to_target" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + max_capacity       = 4
      + min_capacity       = 2
      + resource_id        = "service/api-cluster/api-service"
      + role_arn           = (known after apply)
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"
      + tags_all           = {
          + "App"         = "API Livros"
          + "Environment" = "Production"
          + "Managed-by"  = "Terraform"
          + "Owner"       = "Anderson Quideroli"
          + "Project"     = "AWS-challenge"
          + "Version"     = "1.0"
        }
    }

  # aws_cloudwatch_log_group.datadog_agent will be created
+ resource "aws_cloudwatch_log_group" "datadog_agent" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/ecs/datadog-agent"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags_all          = {
          + "App"         = "API Livros"
          + "Environment" = "Production"
          + "Managed-by"  = "Terraform"
          + "Owner"       = "Anderson Quideroli"
          + "Project"     = "AWS-challenge"
          + "Version"     = "1.0"
        }
    }

  # aws_cloudwatch_metric_alarm.ecs_alert_High_cpuutilization will be created
+ resource "aws_cloudwatch_metric_alarm" "ecs_alert_High_cpuutilization" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_name                            = "quideroli/aws-challenge-ECS-High-CPUUtilization"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + datapoints_to_alarm                   = 1
      + dimensions                            = {
          + "ClusterName" = "api-cluster"
          + "ServiceName" = "api-service"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "CPUUtilization"
      + namespace                             = "AWS/ECS"
      + period                                = 300
      + statistic                             = "Average"
      + tags_all                              = {
          + "App"         = "API Livros"
          + "Environment" = "Production"
          + "Managed-by"  = "Terraform"
          + "Owner"       = "Anderson Quideroli"
          + "Project"     = "AWS-challenge"
          + "Version"     = "1.0"
        }
      + threshold                             = 80
      + treat_missing_data                    = "missing"
        # (1 unchanged attribute hidden)
    }

  # aws_cloudwatch_metric_alarm.ecs_alert_High_memoryutilization will be created
+ resource "aws_cloudwatch_metric_alarm" "ecs_alert_High_memoryutilization" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_name                            = "quideroli/aws-challenge-ECS-High-MemoryUtilization"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + datapoints_to_alarm                   = 1
      + dimensions                            = {
          + "ClusterName" = "api-cluster"
          + "ServiceName" = "api-service"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "MemoryUtilization"
      + namespace                             = "AWS/ECS"
      + period                                = 300
      + statistic                             = "Average"
      + tags_all                              = {
          + "App"         = "API Livros"
          + "Environment" = "Production"
          + "Managed-by"  = "Terraform"
          + "Owner"       = "Anderson Quideroli"
          + "Project"     = "AWS-challenge"
          + "Version"     = "1.0"
        }
      + threshold                             = 80
      + treat_missing_data                    = "missing"
        # (1 unchanged attribute hidden)
    }

  # aws_cloudwatch_metric_alarm.ecs_alert_task_execution_stopped will be created
+ resource "aws_cloudwatch_metric_alarm" "ecs_alert_task_execution_stopped" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_name                            = "quideroli/aws-challenge-ECS-Task-Execution-Stopped"
      + arn                                   = (known after apply)
      + comparison_operator                   = "LessThanOrEqualToThreshold"
      + datapoints_to_alarm                   = 1
      + dimensions                            = {
          + "ClusterName" = "api-cluster"
          + "ServiceName" = "api-service"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "RunningTaskCount"
      + namespace                             = "ECS/ContainerInsights"
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = {
          + "App"         = "API Livros"
          + "Environment" = "Production"
          + "Managed-by"  = "Terraform"
          + "Owner"       = "Anderson Quideroli"
          + "Project"     = "AWS-challenge"
          + "Version"     = "1.0"
        }
      + threshold                             = 0
      + treat_missing_data                    = "missing"
        # (1 unchanged attribute hidden)
    }

  # aws_codedeploy_app.ecs will be created
+ resource "aws_codedeploy_app" "ecs" {
      + application_id      = (known after apply)
      + arn                 = (known after apply)
      + compute_platform    = "ECS"
      + github_account_name = (known after apply)
      + id                  = (known after apply)
      + linked_to_github    = (known after apply)
      + name                = "api-livros-codedeploy"
      + tags_all            = {
          + "App"         = "API Livros"
          + "Environment" = "Production"
          + "Managed-by"  = "Terraform"
          + "Owner"       = "Anderson Quideroli"
          + "Project"     = "AWS-challenge"
          + "Version"     = "1.0"
        }
    }

  # aws_codedeploy_deployment_group.ecs will be created
+ resource "aws_codedeploy_deployment_group" "ecs" {
      + app_name               = "api-livros-codedeploy"
      + arn                    = (known after apply)
      + compute_platform       = (known after apply)
      + deployment_config_name = "CodeDeployDefault.ECSAllAtOnce"
      + deployment_group_id    = (known after apply)
      + deployment_group_name  = "api-livros-deployment-group"
      + id                     = (known after apply)
      + service_role_arn       = (known after apply)
      + tags_all               = {
          + "App"         = "API Livros"
          + "Environment" = "Production"
          + "Managed-by"  = "Terraform"
          + "Owner"       = "Anderson Quideroli"
          + "Project"     = "AWS-challenge"
          + "Version"     = "1.0"
        }

      + auto_rollback_configuration {
          + enabled = true
          + events  = [
              + "DEPLOYMENT_FAILURE",
            ]
        }

      + blue_green_deployment_config {
          + deployment_ready_option {
              + action_on_timeout    = "CONTINUE_DEPLOYMENT"
              + wait_time_in_minutes = 0
            }
          + green_fleet_provisioning_option (known after apply)
          + terminate_blue_instances_on_deployment_success {
              + action                           = "TERMINATE"
              + termination_wait_time_in_minutes = 5
            }
        }

      + deployment_style {
          + deployment_option = "WITH_TRAFFIC_CONTROL"
          + deployment_type   = "BLUE_GREEN"
        }

      + ecs_service {
          + cluster_name = "api-cluster"
          + service_name = "api-service"
        }

      + load_balancer_info {
          + target_group_pair_info {
              + prod_traffic_route {
                  + listener_arns = (known after apply)
                }
              + target_group {
                  + name = "tg-blue"
                }
              + target_group {
                  + name = "tg-green"
                }
            }
        }
    }

  # aws_default_route_table.internet_access_public_subrnet will be created
+ resource "aws_default_route_table" "internet_access_public_subrnet" {
      + arn                    = (known after apply)
      + default_route_table_id = (known after apply)
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + route                  = [
          + {
              + cidr_block                 = "0.0.0.0/0"
              + gateway_id                 = (known after apply)
                # (10 unchanged attributes hidden)
            },
        ]
      + tags                   = {
          + "Name" = "route-table-0-public-terraform"
        }
      + tags_all               = {
          + "App"         = "API Livros"
          + "Environment" = "Production"
          + "Managed-by"  = "Terraform"
          + "Name"        = "route-table-0-public-terraform"
          + "Owner"       = "Anderson Quideroli"
          + "Project"     = "AWS-challenge"
          + "Version"     = "1.0"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_ecr_repository.api-livros will be created
+ resource "aws_ecr_repository" "api-livros" {
      + arn                  = (known after apply)
      + force_delete         = true
      + id                   = (known after apply)
      + image_tag_mutability = "IMMUTABLE"
      + name                 = "api-livros"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = {
          + "App"         = "API Livros"
          + "Environment" = "Production"
          + "Managed-by"  = "Terraform"
          + "Owner"       = "Anderson Quideroli"
          + "Project"     = "AWS-challenge"
          + "Version"     = "1.0"
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # aws_ecs_cluster.ecs_cluster will be created
+ resource "aws_ecs_cluster" "ecs_cluster" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "api-cluster"
      + tags_all = {
          + "App"         = "API Livros"
          + "Environment" = "Production"
          + "Managed-by"  = "Terraform"
          + "Owner"       = "Anderson Quideroli"
          + "Project"     = "AWS-challenge"
          + "Version"     = "1.0"
        }

      + setting {
          + name  = "containerInsights"
          + value = "enabled"
        }
    }

  # aws_ecs_service.app_service will be created
+ resource "aws_ecs_service" "app_service" {
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 2
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "api-service"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = {
          + "App"         = "API Livros"
          + "Environment" = "Production"
          + "Managed-by"  = "Terraform"
          + "Owner"       = "Anderson Quideroli"
          + "Project"     = "AWS-challenge"
          + "Version"     = "1.0"
        }
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + deployment_controller {
          + type = "CODE_DEPLOY"
        }

      + load_balancer {
          + container_name   = "api-task"
          + container_port   = 8080
          + target_group_arn = (known after apply)
            # (1 unchanged attribute hidden)
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = (known after apply)
          + subnets          = (known after apply)
        }
    }

  # aws_ecs_task_definition.app_task will be created
+ resource "aws_ecs_task_definition" "app_task" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + cpu          = 256
                  + dockerLabels = {
                      + "com.datadoghq.tags.env"     = "dev"
                      + "com.datadoghq.tags.service" = "api-livros"
                      + "com.datadoghq.tags.version" = "1.0.0"
                    }
                  + entryPoint   = [
                      + "sh",
                      + "-c",
                      + "ddtrace-run python ./api_livros.py",
                    ]
                  + environment  = [
                      + {
                          + name  = "DD_AGENT_HOST"
                          + value = "localhost"
                        },
                      + {
                          + name  = "DD_ENV"
                          + value = "dev"
                        },
                      + {
                          + name  = "DD_LOGS_INJECTION"
                          + value = "true"
                        },
                      + {
                          + name  = "DD_SERVICE"
                          + value = "api-livros"
                        },
                      + {
                          + name  = "DD_VERSION"
                          + value = "1.0.0"
                        },
                    ]
                  + essential    = true
                  + image        = "053236955074.dkr.ecr.us-east-1.amazonaws.com/api-livros:1.0"
                  + memory       = 512
                  + name         = "api-task"
                  + portMappings = [
                      + {
                          + containerPort = 8080
                          + hostPort      = 8080
                        },
                    ]
                },
              + {
                  + cpu              = 256
                  + environment      = [
                      + {
                          + name  = "DD_API_KEY"
                          + value = "<SUA_API_KEY>"
                        },
                      + {
                          + name  = "DD_SITE"
                          + value = "us5.datadoghq.com"
                        },
                      + {
                          + name  = "ECS_FARGATE"
                          + value = "true"
                        },
                    ]
                  + essential        = false
                  + image            = "public.ecr.aws/datadog/agent:latest"
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "/ecs/datadog-agent"
                          + awslogs-region        = "us-east-1"
                          + awslogs-stream-prefix = "ecs"
                        }
                    }
                  + memory           = 512
                  + name             = "datadog-agent"
                  + portMappings     = [
                      + {
                          + containerPort = 8126
                          + hostPort      = 8126
                          + protocol      = "tcp"
                        },
                    ]
                },
            ]
        )
      + cpu                      = "512"
      + execution_role_arn       = (known after apply)
      + family                   = "api-task"
      + id                       = (known after apply)
      + memory                   = "1024"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags_all                 = {
          + "App"         = "API Livros"
          + "Environment" = "Production"
          + "Managed-by"  = "Terraform"
          + "Owner"       = "Anderson Quideroli"
          + "Project"     = "AWS-challenge"
          + "Version"     = "1.0"
        }
    }

  # aws_eip.eip_one will be created
+ resource "aws_eip" "eip_one" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name" = "eip-nat-gw-0-terraform"
        }
      + tags_all             = {
          + "App"         = "API Livros"
          + "Environment" = "Production"
          + "Managed-by"  = "Terraform"
          + "Name"        = "eip-nat-gw-0-terraform"
          + "Owner"       = "Anderson Quideroli"
          + "Project"     = "AWS-challenge"
          + "Version"     = "1.0"
        }
      + vpc                  = (known after apply)
    }

  # aws_eip.eip_two will be created
+ resource "aws_eip" "eip_two" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name" = "eip-nat-gw-1-terraform"
        }
      + tags_all             = {
          + "App"         = "API Livros"
          + "Environment" = "Production"
          + "Managed-by"  = "Terraform"
          + "Name"        = "eip-nat-gw-1-terraform"
          + "Owner"       = "Anderson Quideroli"
          + "Project"     = "AWS-challenge"
          + "Version"     = "1.0"
        }
      + vpc                  = (known after apply)
    }

  # aws_iam_policy.datadog_agent_policy will be created
+ resource "aws_iam_policy" "datadog_agent_policy" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "datadog-agent-policy"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ecs:ListClusters",
                          + "ecs:DescribeClusters",
                          + "ecs:ListContainerInstances",
                          + "ecs:DescribeContainerInstances",
                          + "ecs:DescribeTasks",
                          + "ecs:ListTasks",
                          + "ecs:ListServices",
                          + "ecs:DescribeServices",
                          + "ec2:DescribeInstances",
                          + "ec2:DescribeTags",
                          + "ec2:DescribeRegions",
                          + "cloudwatch:GetMetricData",
                          + "cloudwatch:ListMetrics",
                          + "cloudwatch:GetMetricStatistics",
                          + "logs:DescribeLogGroups",
                          + "logs:DescribeLogStreams",
                          + "logs:GetLogEvents",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = {
          + "App"         = "API Livros"
          + "Environment" = "Production"
          + "Managed-by"  = "Terraform"
          + "Owner"       = "Anderson Quideroli"
          + "Project"     = "AWS-challenge"
          + "Version"     = "1.0"
        }
    }

  # aws_iam_role.codedeploy_role will be created
+ resource "aws_iam_role" "codedeploy_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "codedeploy.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "CodeDeployECSServiceRole"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "App"         = "API Livros"
          + "Environment" = "Production"
          + "Managed-by"  = "Terraform"
          + "Owner"       = "Anderson Quideroli"
          + "Project"     = "AWS-challenge"
          + "Version"     = "1.0"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role.iam_role_ecs_task_execution will be created
+ resource "aws_iam_role" "iam_role_ecs_task_execution" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ecsTaskExecutionRole"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "App"         = "API Livros"
          + "Environment" = "Production"
          + "Managed-by"  = "Terraform"
          + "Owner"       = "Anderson Quideroli"
          + "Project"     = "AWS-challenge"
          + "Version"     = "1.0"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role_policy_attachment.AmazonECSTaskExecutionRolePolicyAttach will be created
+ resource "aws_iam_role_policy_attachment" "AmazonECSTaskExecutionRolePolicyAttach" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
      + role       = "ecsTaskExecutionRole"
    }

  # aws_iam_role_policy_attachment.codedeploy_role_policy will be created
+ resource "aws_iam_role_policy_attachment" "codedeploy_role_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AWSCodeDeployRoleForECS"
      + role       = "CodeDeployECSServiceRole"
    }

  # aws_iam_role_policy_attachment.datadog_agent_policy will be created
+ resource "aws_iam_role_policy_attachment" "datadog_agent_policy" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "ecsTaskExecutionRole"
    }

  # aws_internet_gateway.internet_gateway will be created
+ resource "aws_internet_gateway" "internet_gateway" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "internet-gateway-terraform"
        }
      + tags_all = {
          + "App"         = "API Livros"
          + "Environment" = "Production"
          + "Managed-by"  = "Terraform"
          + "Name"        = "internet-gateway-terraform"
          + "Owner"       = "Anderson Quideroli"
          + "Project"     = "AWS-challenge"
          + "Version"     = "1.0"
        }
      + vpc_id   = (known after apply)
    }

  # aws_lb_listener.listener will be created
+ resource "aws_lb_listener" "listener" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags_all          = {
          + "App"         = "API Livros"
          + "Environment" = "Production"
          + "Managed-by"  = "Terraform"
          + "Owner"       = "Anderson Quideroli"
          + "Project"     = "AWS-challenge"
          + "Version"     = "1.0"
        }

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # aws_lb_target_group.blue will be created
+ resource "aws_lb_target_group" "blue" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = false
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "tg-blue"
      + port                               = 8080
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Name" = "alb-tg-blue"
        }
      + tags_all                           = {
          + "App"         = "API Livros"
          + "Environment" = "Production"
          + "Managed-by"  = "Terraform"
          + "Name"        = "alb-tg-blue"
          + "Owner"       = "Anderson Quideroli"
          + "Project"     = "AWS-challenge"
          + "Version"     = "1.0"
        }
      + target_type                        = "ip"
      + vpc_id                             = (known after apply)

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 30
          + matcher             = "200"
          + path                = "/livros"
          + port                = "8080"
          + protocol            = "HTTP"
          + timeout             = (known after apply)
          + unhealthy_threshold = 3
        }

      + stickiness (known after apply)

      + target_failover (known after apply)
    }

  # aws_lb_target_group.green will be created
+ resource "aws_lb_target_group" "green" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = false
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "tg-green"
      + port                               = 8080
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Name" = "alb-tg-green"
        }
      + tags_all                           = {
          + "App"         = "API Livros"
          + "Environment" = "Production"
          + "Managed-by"  = "Terraform"
          + "Name"        = "alb-tg-green"
          + "Owner"       = "Anderson Quideroli"
          + "Project"     = "AWS-challenge"
          + "Version"     = "1.0"
        }
      + target_type                        = "ip"
      + vpc_id                             = (known after apply)

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 30
          + matcher             = "200"
          + path                = "/livros"
          + port                = "8080"
          + protocol            = "HTTP"
          + timeout             = (known after apply)
          + unhealthy_threshold = 3
        }

      + stickiness (known after apply)

      + target_failover (known after apply)
    }

  # aws_nat_gateway.nat_gw_subnet0 will be created
+ resource "aws_nat_gateway" "nat_gw_subnet0" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Name" = "Nat-gateway-subnet0-terraform"
        }
      + tags_all                           = {
          + "App"         = "API Livros"
          + "Environment" = "Production"
          + "Managed-by"  = "Terraform"
          + "Name"        = "Nat-gateway-subnet0-terraform"
          + "Owner"       = "Anderson Quideroli"
          + "Project"     = "AWS-challenge"
          + "Version"     = "1.0"
        }
    }

  # aws_nat_gateway.nat_gw_subnet1 will be created
+ resource "aws_nat_gateway" "nat_gw_subnet1" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Name" = "Nat-gateway-subnet1-terraform"
        }
      + tags_all                           = {
          + "App"         = "API Livros"
          + "Environment" = "Production"
          + "Managed-by"  = "Terraform"
          + "Name"        = "Nat-gateway-subnet1-terraform"
          + "Owner"       = "Anderson Quideroli"
          + "Project"     = "AWS-challenge"
          + "Version"     = "1.0"
        }
    }

  # aws_route_table.route_table_private_one will be created
+ resource "aws_route_table" "route_table_private_one" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + cidr_block                 = "0.0.0.0/0"
              + nat_gateway_id             = (known after apply)
                # (11 unchanged attributes hidden)
            },
        ]
      + tags             = {
          + "Name" = "route-table-0-private-terraform"
        }
      + tags_all         = {
          + "App"         = "API Livros"
          + "Environment" = "Production"
          + "Managed-by"  = "Terraform"
          + "Name"        = "route-table-0-private-terraform"
          + "Owner"       = "Anderson Quideroli"
          + "Project"     = "AWS-challenge"
          + "Version"     = "1.0"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.route_table_private_two will be created
+ resource "aws_route_table" "route_table_private_two" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + cidr_block                 = "0.0.0.0/0"
              + nat_gateway_id             = (known after apply)
                # (11 unchanged attributes hidden)
            },
        ]
      + tags             = {
          + "Name" = "route-table-1-private-terraform"
        }
      + tags_all         = {
          + "App"         = "API Livros"
          + "Environment" = "Production"
          + "Managed-by"  = "Terraform"
          + "Name"        = "route-table-1-private-terraform"
          + "Owner"       = "Anderson Quideroli"
          + "Project"     = "AWS-challenge"
          + "Version"     = "1.0"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table_association.route_table_association_one will be created
+ resource "aws_route_table_association" "route_table_association_one" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.route_table_association_two will be created
+ resource "aws_route_table_association" "route_table_association_two" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_s3_bucket.codedeploy_bucket will be created
+ resource "aws_s3_bucket" "codedeploy_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "codedeploy-api-livros-053236955074"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "Production"
          + "Name"        = "codedeploy-api-livros"
        }
      + tags_all                    = {
          + "App"         = "API Livros"
          + "Environment" = "Production"
          + "Managed-by"  = "Terraform"
          + "Name"        = "codedeploy-api-livros"
          + "Owner"       = "Anderson Quideroli"
          + "Project"     = "AWS-challenge"
          + "Version"     = "1.0"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # aws_security_group.load_balancer_security_group will be created
+ resource "aws_security_group" "load_balancer_security_group" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
                # (1 unchanged attribute hidden)
            },
        ]
      + name                   = "load_balancer_security_group_terraform"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "alb-sg-terraform"
        }
      + tags_all               = {
          + "App"         = "API Livros"
          + "Environment" = "Production"
          + "Managed-by"  = "Terraform"
          + "Name"        = "alb-sg-terraform"
          + "Owner"       = "Anderson Quideroli"
          + "Project"     = "AWS-challenge"
          + "Version"     = "1.0"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.service_security_group will be created
+ resource "aws_security_group" "service_security_group" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + name                   = "service-security-group"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "service-ecs-sg-terraform"
        }
      + tags_all               = {
          + "App"         = "API Livros"
          + "Environment" = "Production"
          + "Managed-by"  = "Terraform"
          + "Name"        = "service-ecs-sg-terraform"
          + "Owner"       = "Anderson Quideroli"
          + "Project"     = "AWS-challenge"
          + "Version"     = "1.0"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_sns_topic.alerta_ecs_infraestrutura will be created
+ resource "aws_sns_topic" "alerta_ecs_infraestrutura" {
      + arn                         = (known after apply)
      + content_based_deduplication = false
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "alerta_ecs_infraestrutura-terraform"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + signature_version           = (known after apply)
      + tags_all                    = {
          + "App"         = "API Livros"
          + "Environment" = "Production"
          + "Managed-by"  = "Terraform"
          + "Owner"       = "Anderson Quideroli"
          + "Project"     = "AWS-challenge"
          + "Version"     = "1.0"
        }
      + tracing_config              = (known after apply)
    }

  # aws_sns_topic_subscription.subscription_infraestrutura[0] will be created
+ resource "aws_sns_topic_subscription" "subscription_infraestrutura" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = "anderson.quideroli2@gmail.com"
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "email"
      + raw_message_delivery            = false
      + topic_arn                       = (known after apply)
    }

  # aws_sns_topic_subscription.subscription_infraestrutura[1] will be created
+ resource "aws_sns_topic_subscription" "subscription_infraestrutura" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = "anderson.quideroli@hotmail.com"
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "email"
      + raw_message_delivery            = false
      + topic_arn                       = (known after apply)
    }

  # aws_subnet.private_subnet[0] will be created
+ resource "aws_subnet" "private_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "subnet-private-0-terraform"
        }
      + tags_all                                       = {
          + "App"         = "API Livros"
          + "Environment" = "Production"
          + "Managed-by"  = "Terraform"
          + "Name"        = "subnet-private-0-terraform"
          + "Owner"       = "Anderson Quideroli"
          + "Project"     = "AWS-challenge"
          + "Version"     = "1.0"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.private_subnet[1] will be created
+ resource "aws_subnet" "private_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.3.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "subnet-private-1-terraform"
        }
      + tags_all                                       = {
          + "App"         = "API Livros"
          + "Environment" = "Production"
          + "Managed-by"  = "Terraform"
          + "Name"        = "subnet-private-1-terraform"
          + "Owner"       = "Anderson Quideroli"
          + "Project"     = "AWS-challenge"
          + "Version"     = "1.0"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.public_subnet[0] will be created
+ resource "aws_subnet" "public_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.0.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "subnet-public-0-terraform"
        }
      + tags_all                                       = {
          + "App"         = "API Livros"
          + "Environment" = "Production"
          + "Managed-by"  = "Terraform"
          + "Name"        = "subnet-public-0-terraform"
          + "Owner"       = "Anderson Quideroli"
          + "Project"     = "AWS-challenge"
          + "Version"     = "1.0"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.public_subnet[1] will be created
+ resource "aws_subnet" "public_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "subnet-public-1-terraform"
        }
      + tags_all                                       = {
          + "App"         = "API Livros"
          + "Environment" = "Production"
          + "Managed-by"  = "Terraform"
          + "Name"        = "subnet-public-1-terraform"
          + "Owner"       = "Anderson Quideroli"
          + "Project"     = "AWS-challenge"
          + "Version"     = "1.0"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_vpc.vpc will be created
+ resource "aws_vpc" "vpc" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = (known after apply)
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name" = "vpc-terraform"
        }
      + tags_all                             = {
          + "App"         = "API Livros"
          + "Environment" = "Production"
          + "Managed-by"  = "Terraform"
          + "Name"        = "vpc-terraform"
          + "Owner"       = "Anderson Quideroli"
          + "Project"     = "AWS-challenge"
          + "Version"     = "1.0"
        }
    }

Plan: 44 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ api_livros_url         = (known after apply)
+ codedeploy_bucket_name = "codedeploy-api-livros-053236955074"
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p terraform-infra
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://atlantis.local/lock?id=anderson-quideroli%252Faws-challenge-api-livros%252FTERRAFORM%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p terraform-infra
  ```
Plan: 44 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```